Tekla.Structures.ModelInternal.UDAChanges
UDA changes for an object.

Tekla.Structures.ModelInternal.UDAChanges.Changed
Changed UDAs, in form of name -> value. The value can be on type string, int or double
which corresponds to the UDA type.

Tekla.Structures.ModelInternal.UDAChanges.Deleted
Deleted UDA names.